
# tap repositories and their packages

tap 'buo/cask-upgrade'

tap 'caskroom/cask'
cask '1password'
cask 'alfred'
cask 'appcleaner'
cask 'atom'
cask 'bathyscaphe'
cask 'bettertouchtool'
cask 'caffeine'
cask 'cheatsheet'
cask 'clamxav'
cask 'clipy'
cask 'coda'
cask 'datagrip'
cask 'diskwave'
cask 'docker'
cask 'eclipse-jee'
cask 'evernote'
cask 'filezilla'
cask 'firefox'
cask 'fluid'
cask 'google-chrome'
cask 'hammerspoon'
cask 'handbrake'
cask 'hipchat'
cask 'intellij-idea'
cask 'istat-menus'
cask 'iterm2'
cask 'java'
cask 'kitematic'
cask 'launchrocket'
cask 'libreoffice'
cask 'limechat'
cask 'macdown'
cask 'near-lock'
cask 'nvalt'
cask 'pg-commander'
cask 'pingendo'
cask 'psequel'
cask 'qlmarkdown'
cask 'rubymine'
cask 'scrivener'
cask 'sequel-pro'
cask 'skim'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'steam'
cask 'vagrant'
cask 'virtualbox-extension-pack'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vivaldi'

tap 'homebrew/bundle'

tap 'homebrew/core'
brew 'ack'
brew 'adns'
brew 'ansible'
brew 'ant'
brew 'atk'
brew 'atkmm'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash-completion'
brew 'bison'
brew 'cairo'
brew 'cairomm'
brew 'carthage'
brew 'cloog'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'ddrescue'
brew 'direnv'
brew 'editorconfig'
brew 'elixir'
brew 'emacs'
brew 'erlang'
brew 'ffmpeg'
brew 'fish'
brew 'fontconfig'
brew 'freealut'
brew 'freetype'
brew 'fzf'
brew 'gcc@4.9'
brew 'gd'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'gibo'
brew 'git'
brew 'git-flow'
brew 'glib'
brew 'glibmm'
brew 'gmp'
brew 'gmp@4'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'gradle'
brew 'graphviz'
brew 'gsl'
brew 'gtk+'
brew 'gtkmm'
brew 'harfbuzz'
brew 'hicolor-icon-theme'
brew 'htop-osx'
brew 'hub'
brew 'hugo'
brew 'icu4c'
brew 'imagemagick@6'
brew 'isl@0.11'
brew 'isl@0.12'
brew 'jasper'
brew 'jpeg'
brew 'lame'
brew 'lftp'
brew 'libassuan'
brew 'libcroco'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libidn'
brew 'libksba'
brew 'libmpc@0.8'
brew 'libpng'
brew 'librsvg'
brew 'librsync'
brew 'libsigc++'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libvo-aacenc'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'markdown'
brew 'mas'
brew 'maven'
brew 'mcrypt'
brew 'memcached'
brew 'mercurial'
brew 'mhash'
brew 'mpfr@2'
brew 'mruby'
brew 'nettle'
brew 'nkf'
brew 'npth'
brew 'nvm'
brew 'openssh'
brew 'openssl'
brew 'openssl@1.1'
brew 'p11-kit'
brew 'pango'
brew 'pangomm'
brew 'pcre'
brew 'pcre2'
brew 'peco'
brew 'phantomjs'
brew 'pinentry'
brew 'pixman'
brew 'pkg-config'
brew 'popt'
brew 'python'
brew 'qt'
brew 'rdiff-backup'
brew 're2c'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'rmtrash'
brew 'selenium-server-standalone'
brew 'shared-mime-info'
brew 'smartmontools'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'swiftlint'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unar'
brew 'unixodbc'
brew 'utf8proc'
brew 'v8'
brew 'webp'
brew 'wxmac'
brew 'x264'
brew 'xvid'
brew 'xz'
brew 'zlib'
brew 'zplug'
brew 'zsh'

tap 'homebrew/php'
brew 'composer'
brew 'php-cs-fixer'
brew 'php70'
brew 'phpbrew'

tap 'puma/puma'
brew 'puma-dev'

tap 'rcmdnk/file'
brew 'brew-file'

# Cask applications
cask 'pixate-studio'
